{
    "python": "I took my first course in Python during my first semester at UIUC, and I've been consistently using Python to write utility scripts and solve interview problems. It's quickly become my favorite programming language! I've also been using Python to tackle AI/ML assignments due to the existance of nice scientific/numerical packages like numpy, pandas, sklearn, ... etc! My favorite things about python are that it can be very concise, has a nice interpreter (I use bpython), and that it treats functions as first class.",
    "java": "I took my first Java course during my last semester in high school, so technically Java is the first programming language I've learned! However, Java isn't my favorite programming language particularly because I find that it's too verbose. My projects at both my previous internships (CMU Cylab, CME Group) were written in Java, so I'd say I'm fairly comfortable with working on larger scale projects with the language. During my SP19 semester, I also worked as a code moderator for a programming design course taught partially in Java. ",
    "cpp": "During the first semester of my Sophomore year at UIUC (FA18), I took Data Structures which also taught cpp basics. All the programming assignments were to be written in cpp, which was both a blessing and a curse. I've had some long nights befriending gdb and debugging Segmentation Faults, but I also became quite comfortable with concepts like indirection, dynamic/static memory, and memory managment. During my SP19 semester, I also worked as a code moderator for a programming design course taught partially in CPP which involved me judging the design/test/style qualities of Freshman CPP projects. However, since the specification of CPP is so large, there is still a lot which I don't know, and I would really like to get better at it. This summer (2019) my project at Google will be CPP intensive, and I'm really looking foreward to that! ",
    "haskell": "During the last semester of my Junior year at UIUC (SP19) I took a Programming Language course primarily taught in Haskell. Haskell was the first functional programming language which I really learned and it allowed me to really get comfortable with Higer Order Functions. There's still a lot of things which I want to get better at, like using State Monads and desiging ADT's! ",
    "javascript": "I never really had formal training with Javascript, but I've worked on a couple of chrome extensions (for school and work), and with frontend frameworks such as React and D3 for my data visualization course. There's still a lot of JS things I want to get better at, like Promises and working in an async environment. "
}
